In [10]:
import numpy as np
import pandas as pd

In [2]:
columns = ['W','X','Y','Z']

In [3]:
index = ['A','B','C','D','E']

In [4]:
from numpy.random import randint

In [7]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [8]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [12]:
df = pd.DataFrame(data,index,columns)

In [13]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [14]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [16]:
df['new'] = df['W'] + df['Y']

In [17]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [19]:
df = df.drop('new',axis=1)

In [20]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [22]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [24]:
df.iloc[2]

W     2
X    21
Y   -26
Z   -13
Name: C, dtype: int32

In [25]:
df.loc[['A','D'],['Y','Z']]

   Y   Z
A -8 -86
D  3  51

In [26]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [27]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [28]:
df[df['X']>0]['W']

A     2
C     2
E    30
Name: W, dtype: int32

In [29]:
df[df['X']>0].iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [30]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [31]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [32]:
new_ind = ['CA','NY','WY','OR','CO']

In [33]:
df['States'] = new_ind

In [34]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [35]:
df.set_index('States')

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99